app/views/memberships/index.html.erb

        <div class="well">
          <%= f.collection_select(:user_id, User.all, :id, :full_name, {prompt: "Please select a user"}, {class: "form-control"}) %>
---
SELECT "users".* FROM "users"

        <tbody>
          <% @project.memberships.each do |membership| %>
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."project_id" = $1  [["project_id", 14]]