app/views/tasks/index.html.erb

      <tr>
        <td><s><%= link_to task.description, project_task_path(@project, task) %> <span class="badge"><%= task.comments.count %></span></s></td>
---
SELECT "comments".* FROM "comments"
SELECT COUNT(*) FROM "comments" WHERE "comments"."task_id" = $1  [["task_id", 123]]