app/views/projects/index.html.erb

      <td><%= link_to ap.name, project_path(ap) %></td>
      <td><%= link_to ap.tasks.count, project_tasks_path(ap) %></td>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 8]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 12]]