app/views/projects/show.html.erb


<p><%= link_to pluralize(@project.tasks.count, "Task"), project_tasks_path(@project) %></p>
<p><%= link_to pluralize(@project.memberships.count, "Membership"), project_memberships_path(@project) %></p>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 12]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 12]]
SELECT COUNT(*) FROM "memberships" WHERE "memberships"."project_id" = $1  [["project_id", 14]]