app/controllers/comments_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 22]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 123]]
INSERT INTO "comments" ("body", "user_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "this is a comment"], ["user_id", 50], ["task_id", 123], ["created_at", "2015-03-11 20:55:15.055911"], ["updated_at", "2015-03-11 20:55:15.055911"]]
---
  def create
    @project = Project.find(params[:project_id])
    @task = Task.find(params[:task_id])
    @comment = @task.comments.new(comment_params.merge(user_id: current_user.id))
    if @comment.save