app/controllers/memberships_controller.rb

INSERT INTO "memberships" ("user_id", "role", "project_id") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 43], ["role", "Member"], ["project_id", 14]]
---
  def create
    @membership = @project.memberships.new(membership_params)
    if @membership.save

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = $1 LIMIT 1  [["id", 67]]
UPDATE "memberships" SET "role" = $1 WHERE "memberships"."id" = $2  [["role", "Owner"], ["id", 67]]
---
  def update
    @membership = Membership.find(params[:id])
    if @membership.update(membership_params)

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = $1 LIMIT 1  [["id", 37]]
DELETE FROM "memberships" WHERE "memberships"."id" = $1  [["id", 37]]
---
  def destroy
    @membership = Membership.find(params[:id])
    @membership.destroy