app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "cool"], ["created_at", "2015-03-05 22:20:08.112763"], ["updated_at", "2015-03-05 22:20:08.112763"]]
INSERT INTO "memberships" ("user_id", "role", "project_id") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 543], ["role", "Owner"], ["project_id", 246]]
---
  def create
    @project = Project.new(project_params)
    if @project.save
      @project.memberships.create(user_id: current_user.id, role: "Owner")

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 14]]
---
  def update
    @project = Project.find(params[:id])

SELECT "projects".* FROM "projects"
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 8]]
---
  def show
    @projects = Project.all
    @project = Project.find(params[:id])