app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 14]]
---
  def index
    @tasks = @project.tasks.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND "tasks"."id" = $2 LIMIT 1  [["project_id", 12], ["id", 115]]
SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = $1  [["task_id", 123]]
---
  def show
    @task = @project.tasks.find(params[:id])
    @comments = @task.comments.all

INSERT INTO "tasks" ("description", "due_date", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "this is a new task"], ["due_date", "2015-03-25"], ["project_id", 15], ["created_at", "2015-03-06 17:58:34.639982"], ["updated_at", "2015-03-06 17:58:34.639982"]]
---
  def create
    @task = @project.tasks.new(task_params)
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND "tasks"."id" = $2 LIMIT 1  [["project_id", 12], ["id", 114]]
---
  def edit
    @task = @project.tasks.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 114]]
UPDATE "tasks" SET "description" = $1, "complete" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", "updated"], ["complete", "f"], ["updated_at", "2015-03-05 23:22:43.340611"], ["id", 114]]
---
  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)