app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Joke"], ["password_digest", "$2a$04$4JN47v1ezrz.5nG19KUY/.KGonx.JEEXtb50GBKfLND9nBedk5vsa"], ["updated_at", "2015-03-05 21:38:27.499571"], ["id", 56]]
---
  def update
    if @user.update(user_params)