app/views/about/index.html.haml

  %p
  =pluralize(Project.all.count, "Project") + ","
  =pluralize(Task.all.count, "Task") + ","
  =pluralize(Membership.all.count, "Project Member") + ", "
  =pluralize(User.all.count, "User") + ", "
  =pluralize(Comment.all.count, "Comment")
---
SELECT COUNT(*) FROM "projects"
SELECT COUNT(*) FROM "tasks"
SELECT COUNT(*) FROM "memberships"
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "comments"